podonoghue/usbdm-flash-routines/HCS08-PTxx-flash-program/Project_Headers/mc9s08pt60.h
#define PORT_PTAD_PTAD0_MASK            1U
#define PORT_PTAD_PTAD1_MASK            2U
#define PORT_PTAD_PTAD2_MASK            4U
#define PORT_PTAD_PTAD3_MASK            8U
#define PORT_PTAD_PTAD4_MASK            16U
#define PORT_PTAD_PTAD5_MASK            32U
#define PORT_PTAD_PTAD6_MASK            64U
#define PORT_PTAD_PTAD7_MASK            128U


/*** PORT_PTBD - Port B Data Register; 0x00000001 ***/
typedef union {
  byte Byte;
  struct {
    byte PTBD0       :1; 
    byte PTBD1       :1; 
    byte PTBD2       :1; 
    byte PTBD3       :1; 
    byte PTBD4       :1; 
    byte PTBD5       :1; 
    byte PTBD6       :1; 
    byte PTBD7       :1; 
  } Bits;
} PORT_PTBDSTR;
extern volatile PORT_PTBDSTR _PORT_PTBD @0x00000001;
#define PORT_PTBD                       _PORT_PTBD.Byte
#define PORT_PTBD_PTBD0                 _PORT_PTBD.Bits.PTBD0
#define PORT_PTBD_PTBD1                 _PORT_PTBD.Bits.PTBD1
#define PORT_PTBD_PTBD2                 _PORT_PTBD.Bits.PTBD2
#define PORT_PTBD_PTBD3                 _PORT_PTBD.Bits.PTBD3
#define PORT_PTBD_PTBD4                 _PORT_PTBD.Bits.PTBD4
#define PORT_PTBD_PTBD5                 _PORT_PTBD.Bits.PTBD5
#define PORT_PTBD_PTBD6                 _PORT_PTBD.Bits.PTBD6
#define PORT_PTBD_PTBD7                 _PORT_PTBD.Bits.PTBD7

#define PORT_PTBD_PTBD0_MASK            1U
#define PORT_PTBD_PTBD1_MASK            2U
#define PORT_PTBD_PTBD2_MASK            4U
#define PORT_PTBD_PTBD3_MASK            8U
#define PORT_PTBD_PTBD4_MASK            16U
#define PORT_PTBD_PTBD5_MASK            32U
#define PORT_PTBD_PTBD6_MASK            64U
#define PORT_PTBD_PTBD7_MASK            128U


/*** PORT_PTCD - Port C Data Register; 0x00000002 ***/
typedef union {
  byte Byte;
  struct {
    byte PTCD0       :1; 
    byte PTCD1       :1; 
    byte PTCD2       :1; 
    byte PTCD3       :1; 
    byte PTCD4       :1; 
    byte PTCD5       :1; 
    byte PTCD6       :1; 
    byte PTCD7       :1; 
  } Bits;
} PORT_PTCDSTR;
extern volatile PORT_PTCDSTR _PORT_PTCD @0x00000002;
#define PORT_PTCD                       _PORT_PTCD.Byte
#define PORT_PTCD_PTCD0                 _PORT_PTCD.Bits.PTCD0
#define PORT_PTCD_PTCD1                 _PORT_PTCD.Bits.PTCD1
#define PORT_PTCD_PTCD2                 _PORT_PTCD.Bits.PTCD2
#define PORT_PTCD_PTCD3                 _PORT_PTCD.Bits.PTCD3
#define PORT_PTCD_PTCD4                 _PORT_PTCD.Bits.PTCD4
#define PORT_PTCD_PTCD5                 _PORT_PTCD.Bits.PTCD5
#define PORT_PTCD_PTCD6                 _PORT_PTCD.Bits.PTCD6
#define PORT_PTCD_PTCD7                 _PORT_PTCD.Bits.PTCD7

#define PORT_PTCD_PTCD0_MASK            1U
#define PORT_PTCD_PTCD1_MASK            2U
#define PORT_PTCD_PTCD2_MASK            4U
#define PORT_PTCD_PTCD3_MASK            8U
#define PORT_PTCD_PTCD4_MASK            16U
#define PORT_PTCD_PTCD5_MASK            32U
#define PORT_PTCD_PTCD6_MASK            64U
#define PORT_PTCD_PTCD7_MASK            128U


/*** PORT_PTDD - Port D Data Register; 0x00000003 ***/
typedef union {
  byte Byte;
  struct {
    byte PTDD0       :1; 
    byte PTDD1       :1; 
    byte PTDD2       :1; 
    byte PTDD3       :1; 
    byte PTDD4       :1; 
    byte PTDD5       :1; 
    byte PTDD6       :1; 
    byte PTDD7       :1; 
  } Bits;
} PORT_PTDDSTR;
extern volatile PORT_PTDDSTR _PORT_PTDD @0x00000003;
#define PORT_PTDD                       _PORT_PTDD.Byte
#define PORT_PTDD_PTDD0                 _PORT_PTDD.Bits.PTDD0
#define PORT_PTDD_PTDD1                 _PORT_PTDD.Bits.PTDD1
#define PORT_PTDD_PTDD2                 _PORT_PTDD.Bits.PTDD2
#define PORT_PTDD_PTDD3                 _PORT_PTDD.Bits.PTDD3
#define PORT_PTDD_PTDD4                 _PORT_PTDD.Bits.PTDD4
#define PORT_PTDD_PTDD5                 _PORT_PTDD.Bits.PTDD5
#define PORT_PTDD_PTDD6                 _PORT_PTDD.Bits.PTDD6
#define PORT_PTDD_PTDD7                 _PORT_PTDD.Bits.PTDD7

#define PORT_PTDD_PTDD0_MASK            1U
#define PORT_PTDD_PTDD1_MASK            2U
#define PORT_PTDD_PTDD2_MASK            4U
#define PORT_PTDD_PTDD3_MASK            8U
#define PORT_PTDD_PTDD4_MASK            16U
#define PORT_PTDD_PTDD5_MASK            32U
#define PORT_PTDD_PTDD6_MASK            64U
#define PORT_PTDD_PTDD7_MASK            128U


/*** PORT_PTED - Port E Data Register; 0x00000004 ***/
typedef union {
  byte Byte;
  struct {
    byte PTED0       :1; 
    byte PTED1       :1; 
    byte PTED2       :1; 
    byte PTED3       :1; 
    byte PTED4       :1; 
    byte PTED5       :1; 
    byte PTED6       :1; 
    byte PTED7       :1; 
  } Bits;
} PORT_PTEDSTR;
extern volatile PORT_PTEDSTR _PORT_PTED @0x00000004;
#define PORT_PTED                       _PORT_PTED.Byte
#define PORT_PTED_PTED0                 _PORT_PTED.Bits.PTED0
#define PORT_PTED_PTED1                 _PORT_PTED.Bits.PTED1
#define PORT_PTED_PTED2                 _PORT_PTED.Bits.PTED2
#define PORT_PTED_PTED3                 _PORT_PTED.Bits.PTED3
#define PORT_PTED_PTED4                 _PORT_PTED.Bits.PTED4
#define PORT_PTED_PTED5                 _PORT_PTED.Bits.PTED5
#define PORT_PTED_PTED6                 _PORT_PTED.Bits.PTED6
#define PORT_PTED_PTED7                 _PORT_PTED.Bits.PTED7

#define PORT_PTED_PTED0_MASK            1U
#define PORT_PTED_PTED1_MASK            2U
#define PORT_PTED_PTED2_MASK            4U
#define PORT_PTED_PTED3_MASK            8U
#define PORT_PTED_PTED4_MASK            16U
#define PORT_PTED_PTED5_MASK            32U
#define PORT_PTED_PTED6_MASK            64U
#define PORT_PTED_PTED7_MASK            128U


/*** PORT_PTFD - Port F Data Register; 0x00000005 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFD0       :1; 
    byte PTFD1       :1; 
    byte PTFD2       :1; 
    byte PTFD3       :1; 
    byte PTFD4       :1; 
    byte PTFD5       :1; 
    byte PTFD6       :1; 
    byte PTFD7       :1; 
  } Bits;
} PORT_PTFDSTR;
extern volatile PORT_PTFDSTR _PORT_PTFD @0x00000005;
#define PORT_PTFD                       _PORT_PTFD.Byte
#define PORT_PTFD_PTFD0                 _PORT_PTFD.Bits.PTFD0
#define PORT_PTFD_PTFD1                 _PORT_PTFD.Bits.PTFD1
#define PORT_PTFD_PTFD2                 _PORT_PTFD.Bits.PTFD2
#define PORT_PTFD_PTFD3                 _PORT_PTFD.Bits.PTFD3
#define PORT_PTFD_PTFD4                 _PORT_PTFD.Bits.PTFD4
#define PORT_PTFD_PTFD5                 _PORT_PTFD.Bits.PTFD5
#define PORT_PTFD_PTFD6                 _PORT_PTFD.Bits.PTFD6
#define PORT_PTFD_PTFD7                 _PORT_PTFD.Bits.PTFD7

#define PORT_PTFD_PTFD0_MASK            1U
#define PORT_PTFD_PTFD1_MASK            2U
#define PORT_PTFD_PTFD2_MASK            4U
#define PORT_PTFD_PTFD3_MASK            8U
#define PORT_PTFD_PTFD4_MASK            16U
#define PORT_PTFD_PTFD5_MASK            32U
#define PORT_PTFD_PTFD6_MASK            64U
#define PORT_PTFD_PTFD7_MASK            128U


/*** PORT_PTGD - Port G Data Register; 0x00000006 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGD0       :1; 
    byte PTGD1       :1; 
    byte PTGD2       :1; 
    byte PTGD3       :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGD :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PORT_PTGDSTR;
extern volatile PORT_PTGDSTR _PORT_PTGD @0x00000006;
#define PORT_PTGD                       _PORT_PTGD.Byte
#define PORT_PTGD_PTGD0                 _PORT_PTGD.Bits.PTGD0
#define PORT_PTGD_PTGD1                 _PORT_PTGD.Bits.PTGD1
#define PORT_PTGD_PTGD2                 _PORT_PTGD.Bits.PTGD2
#define PORT_PTGD_PTGD3                 _PORT_PTGD.Bits.PTGD3
#define PORT_PTGD_PTGD                  _PORT_PTGD.MergedBits.grpPTGD

#define PORT_PTGD_PTGD0_MASK            1U
#define PORT_PTGD_PTGD1_MASK            2U
#define PORT_PTGD_PTGD2_MASK            4U
#define PORT_PTGD_PTGD3_MASK            8U
#define PORT_PTGD_PTGD_MASK             15U
#define PORT_PTGD_PTGD_BITNUM           0U


/*** PORT_PTHD - Port H Data Register; 0x00000007 ***/
typedef union {
  byte Byte;
  struct {
    byte PTHD0       :1;                                       /* Port H Data Register Bit 0 */
    byte PTHD1       :1;                                       /* Port H Data Register Bit 1 */
    byte PTHD2       :1;                                       /* Port H Data Register Bit 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTHD6       :1;                                       /* Port H Data Register Bit 6 */
    byte PTHD7       :1;                                       /* Port H Data Register Bit 7 */
  } Bits;
  struct {
    byte grpPTHD :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpPTHD_6 :2;
  } MergedBits;
} PORT_PTHDSTR;
