podonoghue/usbdm-flash-routines/HCS08-PTxx-flash-program/Project_Headers/mc9s08pt60.h
/*** TSI_PEN0 - TSI Pin Enable Register 0; 0x0000000C ***/
typedef union {
  byte Byte;
  struct {
    byte PEN0        :1;                                       /* PEN0 */
    byte PEN1        :1;                                       /* PEN1 */
    byte PEN2        :1;                                       /* PEN2 */
    byte PEN3        :1;                                       /* PEN3 */
    byte PEN4        :1;                                       /* PEN4 */
    byte PEN5        :1;                                       /* PEN5 */
    byte PEN6        :1;                                       /* PEN6 */
    byte PEN7        :1;                                       /* PEN7 */
  } Bits;
} TSI_PEN0STR;
extern volatile TSI_PEN0STR _TSI_PEN0 @0x0000000C;
#define TSI_PEN0                        _TSI_PEN0.Byte
#define TSI_PEN0_PEN0                   _TSI_PEN0.Bits.PEN0
#define TSI_PEN0_PEN1                   _TSI_PEN0.Bits.PEN1
#define TSI_PEN0_PEN2                   _TSI_PEN0.Bits.PEN2
#define TSI_PEN0_PEN3                   _TSI_PEN0.Bits.PEN3
#define TSI_PEN0_PEN4                   _TSI_PEN0.Bits.PEN4
#define TSI_PEN0_PEN5                   _TSI_PEN0.Bits.PEN5
#define TSI_PEN0_PEN6                   _TSI_PEN0.Bits.PEN6
#define TSI_PEN0_PEN7                   _TSI_PEN0.Bits.PEN7
/* TSI_PEN_ARR: Access 2 TSI_PENx registers in an array */
#define TSI_PEN_ARR                     ((volatile byte * __far) &TSI_PEN0)

#define TSI_PEN0_PEN0_MASK              1U
#define TSI_PEN0_PEN1_MASK              2U
#define TSI_PEN0_PEN2_MASK              4U
#define TSI_PEN0_PEN3_MASK              8U
#define TSI_PEN0_PEN4_MASK              16U
#define TSI_PEN0_PEN5_MASK              32U
#define TSI_PEN0_PEN6_MASK              64U
#define TSI_PEN0_PEN7_MASK              128U


/*** TSI_PEN1 - TSI Pin Enable Register 1; 0x0000000D ***/
typedef union {
  byte Byte;
  struct {
    byte PEN8        :1;                                       /* PEN8 */
    byte PEN9        :1;                                       /* PEN9 */
    byte PEN10       :1;                                       /* PEN10 */
    byte PEN11       :1;                                       /* PEN11 */
    byte PEN12       :1;                                       /* PEN12 */
    byte PEN13       :1;                                       /* PEN13 */
    byte PEN14       :1;                                       /* PEN14 */
    byte PEN15       :1;                                       /* PEN15 */
  } Bits;
} TSI_PEN1STR;
extern volatile TSI_PEN1STR _TSI_PEN1 @0x0000000D;
#define TSI_PEN1                        _TSI_PEN1.Byte
#define TSI_PEN1_PEN8                   _TSI_PEN1.Bits.PEN8
#define TSI_PEN1_PEN9                   _TSI_PEN1.Bits.PEN9
#define TSI_PEN1_PEN10                  _TSI_PEN1.Bits.PEN10
#define TSI_PEN1_PEN11                  _TSI_PEN1.Bits.PEN11
#define TSI_PEN1_PEN12                  _TSI_PEN1.Bits.PEN12
#define TSI_PEN1_PEN13                  _TSI_PEN1.Bits.PEN13
#define TSI_PEN1_PEN14                  _TSI_PEN1.Bits.PEN14
#define TSI_PEN1_PEN15                  _TSI_PEN1.Bits.PEN15

#define TSI_PEN1_PEN8_MASK              1U
#define TSI_PEN1_PEN9_MASK              2U
#define TSI_PEN1_PEN10_MASK             4U
#define TSI_PEN1_PEN11_MASK             8U
#define TSI_PEN1_PEN12_MASK             16U
#define TSI_PEN1_PEN13_MASK             32U
#define TSI_PEN1_PEN14_MASK             64U
#define TSI_PEN1_PEN15_MASK             128U


/*** TSI_CNT - TSI Counter Register; 0x0000000E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TSI_CNTH - TSI Counter Register: High; 0x0000000E ***/
    union {
      byte Byte;
      struct {
        byte CNTH0       :1;                                       /* CNTH, bit 0 */
        byte CNTH1       :1;                                       /* CNTH, bit 1 */
        byte CNTH2       :1;                                       /* CNTH, bit 2 */
        byte CNTH3       :1;                                       /* CNTH, bit 3 */
        byte CNTH4       :1;                                       /* CNTH, bit 4 */
        byte CNTH5       :1;                                       /* CNTH, bit 5 */
        byte CNTH6       :1;                                       /* CNTH, bit 6 */
        byte CNTH7       :1;                                       /* CNTH, bit 7 */
      } Bits;
    } TSI_CNTHSTR;
    #define TSI_CNTH                    _TSI_CNT.Overlap_STR.TSI_CNTHSTR.Byte
    #define TSI_CNTH_CNTH0              _TSI_CNT.Overlap_STR.TSI_CNTHSTR.Bits.CNTH0
    #define TSI_CNTH_CNTH1              _TSI_CNT.Overlap_STR.TSI_CNTHSTR.Bits.CNTH1
    #define TSI_CNTH_CNTH2              _TSI_CNT.Overlap_STR.TSI_CNTHSTR.Bits.CNTH2
    #define TSI_CNTH_CNTH3              _TSI_CNT.Overlap_STR.TSI_CNTHSTR.Bits.CNTH3
    #define TSI_CNTH_CNTH4              _TSI_CNT.Overlap_STR.TSI_CNTHSTR.Bits.CNTH4
    #define TSI_CNTH_CNTH5              _TSI_CNT.Overlap_STR.TSI_CNTHSTR.Bits.CNTH5
    #define TSI_CNTH_CNTH6              _TSI_CNT.Overlap_STR.TSI_CNTHSTR.Bits.CNTH6
    #define TSI_CNTH_CNTH7              _TSI_CNT.Overlap_STR.TSI_CNTHSTR.Bits.CNTH7
    
    #define TSI_CNTH_CNTH0_MASK         1U
    #define TSI_CNTH_CNTH1_MASK         2U
    #define TSI_CNTH_CNTH2_MASK         4U
    #define TSI_CNTH_CNTH3_MASK         8U
    #define TSI_CNTH_CNTH4_MASK         16U
    #define TSI_CNTH_CNTH5_MASK         32U
    #define TSI_CNTH_CNTH6_MASK         64U
    #define TSI_CNTH_CNTH7_MASK         128U
    

    /*** TSI_CNTL - TSI Counter Register: Low; 0x0000000F ***/
    union {
      byte Byte;
      struct {
        byte CNTL0       :1;                                       /* CNTL, bit 0 */
        byte CNTL1       :1;                                       /* CNTL, bit 1 */
        byte CNTL2       :1;                                       /* CNTL, bit 2 */
        byte CNTL3       :1;                                       /* CNTL, bit 3 */
        byte CNTL4       :1;                                       /* CNTL, bit 4 */
        byte CNTL5       :1;                                       /* CNTL, bit 5 */
        byte CNTL6       :1;                                       /* CNTL, bit 6 */
        byte CNTL7       :1;                                       /* CNTL, bit 7 */
      } Bits;
    } TSI_CNTLSTR;
    #define TSI_CNTL                    _TSI_CNT.Overlap_STR.TSI_CNTLSTR.Byte
    #define TSI_CNTL_CNTL0              _TSI_CNT.Overlap_STR.TSI_CNTLSTR.Bits.CNTL0
    #define TSI_CNTL_CNTL1              _TSI_CNT.Overlap_STR.TSI_CNTLSTR.Bits.CNTL1
    #define TSI_CNTL_CNTL2              _TSI_CNT.Overlap_STR.TSI_CNTLSTR.Bits.CNTL2
    #define TSI_CNTL_CNTL3              _TSI_CNT.Overlap_STR.TSI_CNTLSTR.Bits.CNTL3
    #define TSI_CNTL_CNTL4              _TSI_CNT.Overlap_STR.TSI_CNTLSTR.Bits.CNTL4
    #define TSI_CNTL_CNTL5              _TSI_CNT.Overlap_STR.TSI_CNTLSTR.Bits.CNTL5
    #define TSI_CNTL_CNTL6              _TSI_CNT.Overlap_STR.TSI_CNTLSTR.Bits.CNTL6
    #define TSI_CNTL_CNTL7              _TSI_CNT.Overlap_STR.TSI_CNTLSTR.Bits.CNTL7
    
    #define TSI_CNTL_CNTL0_MASK         1U
    #define TSI_CNTL_CNTL1_MASK         2U
    #define TSI_CNTL_CNTL2_MASK         4U
    #define TSI_CNTL_CNTL3_MASK         8U
    #define TSI_CNTL_CNTL4_MASK         16U
    #define TSI_CNTL_CNTL5_MASK         32U
    #define TSI_CNTL_CNTL6_MASK         64U
    #define TSI_CNTL_CNTL7_MASK         128U
    
  } Overlap_STR;

} TSI_CNTSTR;
extern volatile TSI_CNTSTR _TSI_CNT @0x0000000E;
#define TSI_CNT                         _TSI_CNT.Word


/*** ADC_SC1 - Status and Control Register 1; 0x00000010 ***/
typedef union {
  byte Byte;
  struct {
    byte ADCH0       :1;                                       /* Input Channel Select, bit 0 */
    byte ADCH1       :1;                                       /* Input Channel Select, bit 1 */
    byte ADCH2       :1;                                       /* Input Channel Select, bit 2 */
    byte ADCH3       :1;                                       /* Input Channel Select, bit 3 */
    byte ADCH4       :1;                                       /* Input Channel Select, bit 4 */
    byte ADCO        :1;                                       /* Continuous Conversion Enable */
    byte AIEN        :1;                                       /* Interrupt Enable */
    byte COCO        :1;                                       /* Conversion Complete Flag */
  } Bits;
  struct {
    byte grpADCH :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ADC_SC1STR;
extern volatile ADC_SC1STR _ADC_SC1 @0x00000010;
#define ADC_SC1                         _ADC_SC1.Byte
#define ADC_SC1_ADCH0                   _ADC_SC1.Bits.ADCH0
#define ADC_SC1_ADCH1                   _ADC_SC1.Bits.ADCH1
#define ADC_SC1_ADCH2                   _ADC_SC1.Bits.ADCH2
#define ADC_SC1_ADCH3                   _ADC_SC1.Bits.ADCH3
#define ADC_SC1_ADCH4                   _ADC_SC1.Bits.ADCH4
#define ADC_SC1_ADCO                    _ADC_SC1.Bits.ADCO
#define ADC_SC1_AIEN                    _ADC_SC1.Bits.AIEN
#define ADC_SC1_COCO                    _ADC_SC1.Bits.COCO
#define ADC_SC1_ADCH                    _ADC_SC1.MergedBits.grpADCH

