podonoghue/usbdm-flash-routines/HCS08-PTxx-flash-program/Project_Headers/mc9s08pt60.h
    /*** CRC_P3 - CRC Polynomial 3 Register; 0x00003067 ***/
    union {
      byte Byte;
      struct {
        byte P30         :1;                                       /* CRC Polynominal Bit 7:0, bit 0 */
        byte P31         :1;                                       /* CRC Polynominal Bit 7:0, bit 1 */
        byte P32         :1;                                       /* CRC Polynominal Bit 7:0, bit 2 */
        byte P33         :1;                                       /* CRC Polynominal Bit 7:0, bit 3 */
        byte P34         :1;                                       /* CRC Polynominal Bit 7:0, bit 4 */
        byte P35         :1;                                       /* CRC Polynominal Bit 7:0, bit 5 */
        byte P36         :1;                                       /* CRC Polynominal Bit 7:0, bit 6 */
        byte P37         :1;                                       /* CRC Polynominal Bit 7:0, bit 7 */
      } Bits;
    } CRC_P3STR;
    #define CRC_P3                      _CRC_P2P3.Overlap_STR.CRC_P3STR.Byte
    #define CRC_P3_P30                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P30
    #define CRC_P3_P31                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P31
    #define CRC_P3_P32                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P32
    #define CRC_P3_P33                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P33
    #define CRC_P3_P34                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P34
    #define CRC_P3_P35                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P35
    #define CRC_P3_P36                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P36
    #define CRC_P3_P37                  _CRC_P2P3.Overlap_STR.CRC_P3STR.Bits.P37
    
    #define CRC_P3_P30_MASK             1U
    #define CRC_P3_P31_MASK             2U
    #define CRC_P3_P32_MASK             4U
    #define CRC_P3_P33_MASK             8U
    #define CRC_P3_P34_MASK             16U
    #define CRC_P3_P35_MASK             32U
    #define CRC_P3_P36_MASK             64U
    #define CRC_P3_P37_MASK             128U
    
  } Overlap_STR;

} CRC_P2P3STR;
extern volatile CRC_P2P3STR _CRC_P2P3 @0x00003066;
#define CRC_P2P3                        _CRC_P2P3.Word


/*** CRC_CTRL - CRC Control Register; 0x00003068 ***/
typedef union {
  byte Byte;
  struct {
    byte TCRC        :1;                                       /* Width of Polynomial Generator */
    byte WAS         :1;                                       /* Write CRC data register as seed */
    byte FXOR        :1;                                       /* Complement of Read */
    byte             :1; 
    byte TOTR0       :1;                                       /* Reverse of Read, bit 0 */
    byte TOTR1       :1;                                       /* Reverse of Read, bit 1 */
    byte TOT0        :1;                                       /* Reverse of Write, bit 0 */
    byte TOT1        :1;                                       /* Reverse of Write, bit 1 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpTOTR :2;
    byte grpTOT  :2;
  } MergedBits;
} CRC_CTRLSTR;
extern volatile CRC_CTRLSTR _CRC_CTRL @0x00003068;
#define CRC_CTRL                        _CRC_CTRL.Byte
#define CRC_CTRL_TCRC                   _CRC_CTRL.Bits.TCRC
#define CRC_CTRL_WAS                    _CRC_CTRL.Bits.WAS
#define CRC_CTRL_FXOR                   _CRC_CTRL.Bits.FXOR
#define CRC_CTRL_TOTR0                  _CRC_CTRL.Bits.TOTR0
#define CRC_CTRL_TOTR1                  _CRC_CTRL.Bits.TOTR1
#define CRC_CTRL_TOT0                   _CRC_CTRL.Bits.TOT0
#define CRC_CTRL_TOT1                   _CRC_CTRL.Bits.TOT1
#define CRC_CTRL_TOTR                   _CRC_CTRL.MergedBits.grpTOTR
#define CRC_CTRL_TOT                    _CRC_CTRL.MergedBits.grpTOT

#define CRC_CTRL_TCRC_MASK              1U
#define CRC_CTRL_WAS_MASK               2U
#define CRC_CTRL_FXOR_MASK              4U
#define CRC_CTRL_TOTR0_MASK             16U
#define CRC_CTRL_TOTR1_MASK             32U
#define CRC_CTRL_TOT0_MASK              64U
#define CRC_CTRL_TOT1_MASK              128U
#define CRC_CTRL_TOTR_MASK              48U
#define CRC_CTRL_TOTR_BITNUM            4U
#define CRC_CTRL_TOT_MASK               192U
#define CRC_CTRL_TOT_BITNUM             6U


/*** RTC_SC1 - RTC Status and Control Register 1; 0x0000306A ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RTCO        :1;                                       /* Real-Time Counter Output */
    byte             :1; 
    byte RTIE        :1;                                       /* Real-Time Interrupt Enable */
    byte RTIF        :1;                                       /* Real-Time Interrupt Flag */
  } Bits;
} RTC_SC1STR;
extern volatile RTC_SC1STR _RTC_SC1 @0x0000306A;
#define RTC_SC1                         _RTC_SC1.Byte
#define RTC_SC1_RTCO                    _RTC_SC1.Bits.RTCO
#define RTC_SC1_RTIE                    _RTC_SC1.Bits.RTIE
#define RTC_SC1_RTIF                    _RTC_SC1.Bits.RTIF

#define RTC_SC1_RTCO_MASK               16U
#define RTC_SC1_RTIE_MASK               64U
#define RTC_SC1_RTIF_MASK               128U


/*** RTC_SC2 - RTC Status and Control Register 2; 0x0000306B ***/
typedef union {
  byte Byte;
  struct {
    byte RTCPS0      :1;                                       /* Real-Time Clock Prescaler Select, bit 0 */
    byte RTCPS1      :1;                                       /* Real-Time Clock Prescaler Select, bit 1 */
    byte RTCPS2      :1;                                       /* Real-Time Clock Prescaler Select, bit 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RTCLKS0     :1;                                       /* Real-Time Clock Source Select, bit 0 */
    byte RTCLKS1     :1;                                       /* Real-Time Clock Source Select, bit 1 */
  } Bits;
  struct {
    byte grpRTCPS :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpRTCLKS :2;
  } MergedBits;
} RTC_SC2STR;
