podonoghue/usbdm-flash-routines/HCS08-PTxx-flash-program/Project_Headers/mc9s08pt60.h
extern volatile RTC_SC2STR _RTC_SC2 @0x0000306B;
#define RTC_SC2                         _RTC_SC2.Byte
#define RTC_SC2_RTCPS0                  _RTC_SC2.Bits.RTCPS0
#define RTC_SC2_RTCPS1                  _RTC_SC2.Bits.RTCPS1
#define RTC_SC2_RTCPS2                  _RTC_SC2.Bits.RTCPS2
#define RTC_SC2_RTCLKS0                 _RTC_SC2.Bits.RTCLKS0
#define RTC_SC2_RTCLKS1                 _RTC_SC2.Bits.RTCLKS1
#define RTC_SC2_RTCPS                   _RTC_SC2.MergedBits.grpRTCPS
#define RTC_SC2_RTCLKS                  _RTC_SC2.MergedBits.grpRTCLKS

#define RTC_SC2_RTCPS0_MASK             1U
#define RTC_SC2_RTCPS1_MASK             2U
#define RTC_SC2_RTCPS2_MASK             4U
#define RTC_SC2_RTCLKS0_MASK            64U
#define RTC_SC2_RTCLKS1_MASK            128U
#define RTC_SC2_RTCPS_MASK              7U
#define RTC_SC2_RTCPS_BITNUM            0U
#define RTC_SC2_RTCLKS_MASK             192U
#define RTC_SC2_RTCLKS_BITNUM           6U


/*** RTC_MOD - RTC Modulo Register; 0x0000306C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** RTC_MODH - RTC Modulo Register: High; 0x0000306C ***/
    union {
      byte Byte;
    } RTC_MODHSTR;
    #define RTC_MODH                    _RTC_MOD.Overlap_STR.RTC_MODHSTR.Byte
    

    /*** RTC_MODL - RTC Modulo Register: Low; 0x0000306D ***/
    union {
      byte Byte;
    } RTC_MODLSTR;
    #define RTC_MODL                    _RTC_MOD.Overlap_STR.RTC_MODLSTR.Byte
    
  } Overlap_STR;

} RTC_MODSTR;
extern volatile RTC_MODSTR _RTC_MOD @0x0000306C;
#define RTC_MOD                         _RTC_MOD.Word


/*** RTC_CNT - RTC Counter Register; 0x0000306E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** RTC_CNTH - RTC Counter Register: High; 0x0000306E ***/
    union {
      byte Byte;
    } RTC_CNTHSTR;
    #define RTC_CNTH                    _RTC_CNT.Overlap_STR.RTC_CNTHSTR.Byte
    

    /*** RTC_CNTL - RTC Counter Register: Low; 0x0000306F ***/
    union {
      byte Byte;
    } RTC_CNTLSTR;
    #define RTC_CNTL                    _RTC_CNT.Overlap_STR.RTC_CNTLSTR.Byte
    
  } Overlap_STR;

} RTC_CNTSTR;
extern volatile RTC_CNTSTR _RTC_CNT @0x0000306E;
#define RTC_CNT                         _RTC_CNT.Word


/*** I2C_A1 - I2C Address Register 1; 0x00003070 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte AD0         :1;                                       /* Address, bit 0 */
    byte AD1         :1;                                       /* Address, bit 1 */
    byte AD2         :1;                                       /* Address, bit 2 */
    byte AD3         :1;                                       /* Address, bit 3 */
    byte AD4         :1;                                       /* Address, bit 4 */
    byte AD5         :1;                                       /* Address, bit 5 */
    byte AD6         :1;                                       /* Address, bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpAD   :7;
  } MergedBits;
} I2C_A1STR;
extern volatile I2C_A1STR _I2C_A1 @0x00003070;
#define I2C_A1                          _I2C_A1.Byte
#define I2C_A1_AD0                      _I2C_A1.Bits.AD0
#define I2C_A1_AD1                      _I2C_A1.Bits.AD1
#define I2C_A1_AD2                      _I2C_A1.Bits.AD2
#define I2C_A1_AD3                      _I2C_A1.Bits.AD3
#define I2C_A1_AD4                      _I2C_A1.Bits.AD4
#define I2C_A1_AD5                      _I2C_A1.Bits.AD5
#define I2C_A1_AD6                      _I2C_A1.Bits.AD6
#define I2C_A1_AD                       _I2C_A1.MergedBits.grpAD

#define I2C_A1_AD0_MASK                 2U
#define I2C_A1_AD1_MASK                 4U
#define I2C_A1_AD2_MASK                 8U
#define I2C_A1_AD3_MASK                 16U
#define I2C_A1_AD4_MASK                 32U
#define I2C_A1_AD5_MASK                 64U
#define I2C_A1_AD6_MASK                 128U
#define I2C_A1_AD_MASK                  254U
#define I2C_A1_AD_BITNUM                1U


/*** I2C_F - I2C Frequency Divider register; 0x00003071 ***/
typedef union {
  byte Byte;
  struct {
    byte ICR0        :1;                                       /* Clock rate, bit 0 */
    byte ICR1        :1;                                       /* Clock rate, bit 1 */
    byte ICR2        :1;                                       /* Clock rate, bit 2 */
    byte ICR3        :1;                                       /* Clock rate, bit 3 */
    byte ICR4        :1;                                       /* Clock rate, bit 4 */
    byte ICR5        :1;                                       /* Clock rate, bit 5 */
    byte MULT0       :1;                                       /* The MULT bits define the multiplier factor mul. This factor is used along with the SCL divider to generate the I2C baud rate, bit 0 */
    byte MULT1       :1;                                       /* The MULT bits define the multiplier factor mul. This factor is used along with the SCL divider to generate the I2C baud rate, bit 1 */
  } Bits;
  struct {
    byte grpICR  :6;
    byte grpMULT :2;
  } MergedBits;
} I2C_FSTR;
extern volatile I2C_FSTR _I2C_F @0x00003071;
#define I2C_F                           _I2C_F.Byte
#define I2C_F_ICR0                      _I2C_F.Bits.ICR0
#define I2C_F_ICR1                      _I2C_F.Bits.ICR1
#define I2C_F_ICR2                      _I2C_F.Bits.ICR2
#define I2C_F_ICR3                      _I2C_F.Bits.ICR3
#define I2C_F_ICR4                      _I2C_F.Bits.ICR4
#define I2C_F_ICR5                      _I2C_F.Bits.ICR5
#define I2C_F_MULT0                     _I2C_F.Bits.MULT0
#define I2C_F_MULT1                     _I2C_F.Bits.MULT1
#define I2C_F_ICR                       _I2C_F.MergedBits.grpICR
#define I2C_F_MULT                      _I2C_F.MergedBits.grpMULT

#define I2C_F_ICR0_MASK                 1U
#define I2C_F_ICR1_MASK                 2U
#define I2C_F_ICR2_MASK                 4U
#define I2C_F_ICR3_MASK                 8U
#define I2C_F_ICR4_MASK                 16U
#define I2C_F_ICR5_MASK                 32U
#define I2C_F_MULT0_MASK                64U
#define I2C_F_MULT1_MASK                128U
#define I2C_F_ICR_MASK                  63U
#define I2C_F_ICR_BITNUM                0U
#define I2C_F_MULT_MASK                 192U
#define I2C_F_MULT_BITNUM               6U


/*** I2C_C1 - I2C Control Register 1; 0x00003072 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte WUEN        :1;                                       /* Wakeup enable */
    byte RSTA        :1;                                       /* Repeat START */
    byte TXAK        :1;                                       /* Transmit acknowledge enable */
    byte TX          :1;                                       /* Transmit mode select */
    byte MST         :1;                                       /* Master mode select */
    byte IICIE       :1;                                       /* I2C interrupt enable */
    byte IICEN       :1;                                       /* I2C enable */
  } Bits;
} I2C_C1STR;
extern volatile I2C_C1STR _I2C_C1 @0x00003072;
#define I2C_C1                          _I2C_C1.Byte
#define I2C_C1_WUEN                     _I2C_C1.Bits.WUEN
#define I2C_C1_RSTA                     _I2C_C1.Bits.RSTA
#define I2C_C1_TXAK                     _I2C_C1.Bits.TXAK
#define I2C_C1_TX                       _I2C_C1.Bits.TX
#define I2C_C1_MST                      _I2C_C1.Bits.MST
#define I2C_C1_IICIE                    _I2C_C1.Bits.IICIE
#define I2C_C1_IICEN                    _I2C_C1.Bits.IICEN

#define I2C_C1_WUEN_MASK                2U
#define I2C_C1_RSTA_MASK                4U
#define I2C_C1_TXAK_MASK                8U
#define I2C_C1_TX_MASK                  16U
#define I2C_C1_MST_MASK                 32U
#define I2C_C1_IICIE_MASK               64U
#define I2C_C1_IICEN_MASK               128U


/*** I2C_S - I2C Status Register; 0x00003073 ***/
typedef union {
  byte Byte;
  struct {
    byte RXAK        :1;                                       /* Receive acknowledge */
    byte IICIF       :1;                                       /* Interrupt flag */
    byte SRW         :1;                                       /* Slave read/write */
    byte RAM         :1;                                       /* Range address match */
    byte ARBL        :1;                                       /* Arbitration lost */
    byte BUSY        :1;                                       /* Bus busy */
    byte IAAS        :1;                                       /* Addressed as a slave */
    byte TCF         :1;                                       /* Transfer complete flag */
  } Bits;
} I2C_SSTR;
