podonoghue/usbdm-flash-routines/HCS08-PTxx-flash-program/Project_Headers/mc9s08pt60.h
#define I2C_RA_RAD0_MASK                2U
#define I2C_RA_RAD1_MASK                4U
#define I2C_RA_RAD2_MASK                8U
#define I2C_RA_RAD3_MASK                16U
#define I2C_RA_RAD4_MASK                32U
#define I2C_RA_RAD5_MASK                64U
#define I2C_RA_RAD6_MASK                128U
#define I2C_RA_RAD_MASK                 254U
#define I2C_RA_RAD_BITNUM               1U


/*** I2C_SMB - I2C SMBus Control and Status register; 0x00003078 ***/
typedef union {
  byte Byte;
  struct {
    byte SHTF2IE     :1;                                       /* SHTF2 interrupt enable */
    byte SHTF2       :1;                                       /* SCL high timeout flag 2 */
    byte SHTF1       :1;                                       /* SCL high timeout flag 1 */
    byte SLTF        :1;                                       /* SCL low timeout flag */
    byte TCKSEL      :1;                                       /* Timeout counter clock select */
    byte SIICAEN     :1;                                       /* Second I2C address enable */
    byte ALERTEN     :1;                                       /* SMBus alert response address enable */
    byte FACK        :1;                                       /* Fast NACK/ACK enable */
  } Bits;
} I2C_SMBSTR;
extern volatile I2C_SMBSTR _I2C_SMB @0x00003078;
#define I2C_SMB                         _I2C_SMB.Byte
#define I2C_SMB_SHTF2IE                 _I2C_SMB.Bits.SHTF2IE
#define I2C_SMB_SHTF2                   _I2C_SMB.Bits.SHTF2
#define I2C_SMB_SHTF1                   _I2C_SMB.Bits.SHTF1
#define I2C_SMB_SLTF                    _I2C_SMB.Bits.SLTF
#define I2C_SMB_TCKSEL                  _I2C_SMB.Bits.TCKSEL
#define I2C_SMB_SIICAEN                 _I2C_SMB.Bits.SIICAEN
#define I2C_SMB_ALERTEN                 _I2C_SMB.Bits.ALERTEN
#define I2C_SMB_FACK                    _I2C_SMB.Bits.FACK

#define I2C_SMB_SHTF2IE_MASK            1U
#define I2C_SMB_SHTF2_MASK              2U
#define I2C_SMB_SHTF1_MASK              4U
#define I2C_SMB_SLTF_MASK               8U
#define I2C_SMB_TCKSEL_MASK             16U
#define I2C_SMB_SIICAEN_MASK            32U
#define I2C_SMB_ALERTEN_MASK            64U
#define I2C_SMB_FACK_MASK               128U


/*** I2C_A2 - I2C Address Register 2; 0x00003079 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte SAD0        :1;                                       /* SMBus address, bit 0 */
    byte SAD1        :1;                                       /* SMBus address, bit 1 */
    byte SAD2        :1;                                       /* SMBus address, bit 2 */
    byte SAD3        :1;                                       /* SMBus address, bit 3 */
    byte SAD4        :1;                                       /* SMBus address, bit 4 */
    byte SAD5        :1;                                       /* SMBus address, bit 5 */
    byte SAD6        :1;                                       /* SMBus address, bit 6 */
  } Bits;
  struct {
    byte         :1;
    byte grpSAD  :7;
  } MergedBits;
} I2C_A2STR;
extern volatile I2C_A2STR _I2C_A2 @0x00003079;
#define I2C_A2                          _I2C_A2.Byte
#define I2C_A2_SAD0                     _I2C_A2.Bits.SAD0
#define I2C_A2_SAD1                     _I2C_A2.Bits.SAD1
#define I2C_A2_SAD2                     _I2C_A2.Bits.SAD2
#define I2C_A2_SAD3                     _I2C_A2.Bits.SAD3
#define I2C_A2_SAD4                     _I2C_A2.Bits.SAD4
#define I2C_A2_SAD5                     _I2C_A2.Bits.SAD5
#define I2C_A2_SAD6                     _I2C_A2.Bits.SAD6
#define I2C_A2_SAD                      _I2C_A2.MergedBits.grpSAD

#define I2C_A2_SAD0_MASK                2U
#define I2C_A2_SAD1_MASK                4U
#define I2C_A2_SAD2_MASK                8U
#define I2C_A2_SAD3_MASK                16U
#define I2C_A2_SAD4_MASK                32U
#define I2C_A2_SAD5_MASK                64U
#define I2C_A2_SAD6_MASK                128U
#define I2C_A2_SAD_MASK                 254U
#define I2C_A2_SAD_BITNUM               1U


/*** I2C_SLT - I2C SCL Low Timeout register; 0x0000307A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** I2C_SLTH - I2C SCL Low Timeout Register High; 0x0000307A ***/
    union {
      byte Byte;
      struct {
        byte SSLT0       :1;                                       /* Most significant byte of SCL low timeout value that determines the timeout period of SCL low, bit 0 */
        byte SSLT1       :1;                                       /* Most significant byte of SCL low timeout value that determines the timeout period of SCL low, bit 1 */
        byte SSLT2       :1;                                       /* Most significant byte of SCL low timeout value that determines the timeout period of SCL low, bit 2 */
        byte SSLT3       :1;                                       /* Most significant byte of SCL low timeout value that determines the timeout period of SCL low, bit 3 */
        byte SSLT4       :1;                                       /* Most significant byte of SCL low timeout value that determines the timeout period of SCL low, bit 4 */
        byte SSLT5       :1;                                       /* Most significant byte of SCL low timeout value that determines the timeout period of SCL low, bit 5 */
        byte SSLT6       :1;                                       /* Most significant byte of SCL low timeout value that determines the timeout period of SCL low, bit 6 */
        byte SSLT7       :1;                                       /* Most significant byte of SCL low timeout value that determines the timeout period of SCL low, bit 7 */
      } Bits;
    } I2C_SLTHSTR;
    #define I2C_SLTH                    _I2C_SLT.Overlap_STR.I2C_SLTHSTR.Byte
    #define I2C_SLTH_SSLT0              _I2C_SLT.Overlap_STR.I2C_SLTHSTR.Bits.SSLT0
    #define I2C_SLTH_SSLT1              _I2C_SLT.Overlap_STR.I2C_SLTHSTR.Bits.SSLT1
    #define I2C_SLTH_SSLT2              _I2C_SLT.Overlap_STR.I2C_SLTHSTR.Bits.SSLT2
    #define I2C_SLTH_SSLT3              _I2C_SLT.Overlap_STR.I2C_SLTHSTR.Bits.SSLT3
    #define I2C_SLTH_SSLT4              _I2C_SLT.Overlap_STR.I2C_SLTHSTR.Bits.SSLT4
    #define I2C_SLTH_SSLT5              _I2C_SLT.Overlap_STR.I2C_SLTHSTR.Bits.SSLT5
    #define I2C_SLTH_SSLT6              _I2C_SLT.Overlap_STR.I2C_SLTHSTR.Bits.SSLT6
    #define I2C_SLTH_SSLT7              _I2C_SLT.Overlap_STR.I2C_SLTHSTR.Bits.SSLT7
    
    #define I2C_SLTH_SSLT0_MASK         1U
    #define I2C_SLTH_SSLT1_MASK         2U
    #define I2C_SLTH_SSLT2_MASK         4U
    #define I2C_SLTH_SSLT3_MASK         8U
    #define I2C_SLTH_SSLT4_MASK         16U
    #define I2C_SLTH_SSLT5_MASK         32U
    #define I2C_SLTH_SSLT6_MASK         64U
    #define I2C_SLTH_SSLT7_MASK         128U
    

