podonoghue/usbdm-flash-routines/HCS08-PTxx-flash-program/Project_Headers/mc9s08pt60.h
#define PORT_PTDOE_PTDOE0_MASK          1U
#define PORT_PTDOE_PTDOE1_MASK          2U
#define PORT_PTDOE_PTDOE2_MASK          4U
#define PORT_PTDOE_PTDOE3_MASK          8U
#define PORT_PTDOE_PTDOE4_MASK          16U
#define PORT_PTDOE_PTDOE5_MASK          32U
#define PORT_PTDOE_PTDOE6_MASK          64U
#define PORT_PTDOE_PTDOE7_MASK          128U


/*** PORT_PTEOE - Port E Output Enable Register; 0x000030B4 ***/
typedef union {
  byte Byte;
  struct {
    byte PTEOE0      :1;                                       /* Output Enable for Port E Bit 0 */
    byte PTEOE1      :1;                                       /* Output Enable for Port E Bit 1 */
    byte PTEOE2      :1;                                       /* Output Enable for Port E Bit 2 */
    byte PTEOE3      :1;                                       /* Output Enable for Port E Bit 3 */
    byte PTEOE4      :1;                                       /* Output Enable for Port E Bit 4 */
    byte PTEOE5      :1;                                       /* Output Enable for Port E Bit 5 */
    byte PTEOE6      :1;                                       /* Output Enable for Port E Bit 6 */
    byte PTEOE7      :1;                                       /* Output Enable for Port E Bit 7 */
  } Bits;
} PORT_PTEOESTR;
extern volatile PORT_PTEOESTR _PORT_PTEOE @0x000030B4;
#define PORT_PTEOE                      _PORT_PTEOE.Byte
#define PORT_PTEOE_PTEOE0               _PORT_PTEOE.Bits.PTEOE0
#define PORT_PTEOE_PTEOE1               _PORT_PTEOE.Bits.PTEOE1
#define PORT_PTEOE_PTEOE2               _PORT_PTEOE.Bits.PTEOE2
#define PORT_PTEOE_PTEOE3               _PORT_PTEOE.Bits.PTEOE3
#define PORT_PTEOE_PTEOE4               _PORT_PTEOE.Bits.PTEOE4
#define PORT_PTEOE_PTEOE5               _PORT_PTEOE.Bits.PTEOE5
#define PORT_PTEOE_PTEOE6               _PORT_PTEOE.Bits.PTEOE6
#define PORT_PTEOE_PTEOE7               _PORT_PTEOE.Bits.PTEOE7

#define PORT_PTEOE_PTEOE0_MASK          1U
#define PORT_PTEOE_PTEOE1_MASK          2U
#define PORT_PTEOE_PTEOE2_MASK          4U
#define PORT_PTEOE_PTEOE3_MASK          8U
#define PORT_PTEOE_PTEOE4_MASK          16U
#define PORT_PTEOE_PTEOE5_MASK          32U
#define PORT_PTEOE_PTEOE6_MASK          64U
#define PORT_PTEOE_PTEOE7_MASK          128U


/*** PORT_PTFOE - Port F Output Enable Register; 0x000030B5 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFOE0      :1;                                       /* Output Enable for Port F Bit 0 */
    byte PTFOE1      :1;                                       /* Output Enable for Port F Bit 1 */
    byte PTFOE2      :1;                                       /* Output Enable for Port F Bit 2 */
    byte PTFOE3      :1;                                       /* Output Enable for Port F Bit 3 */
    byte PTFOE4      :1;                                       /* Output Enable for Port F Bit 4 */
    byte PTFOE5      :1;                                       /* Output Enable for Port F Bit 5 */
    byte PTFOE6      :1;                                       /* Output Enable for Port F Bit 6 */
    byte PTFOE7      :1;                                       /* Output Enable for Port F Bit 7 */
  } Bits;
} PORT_PTFOESTR;
extern volatile PORT_PTFOESTR _PORT_PTFOE @0x000030B5;
#define PORT_PTFOE                      _PORT_PTFOE.Byte
#define PORT_PTFOE_PTFOE0               _PORT_PTFOE.Bits.PTFOE0
#define PORT_PTFOE_PTFOE1               _PORT_PTFOE.Bits.PTFOE1
#define PORT_PTFOE_PTFOE2               _PORT_PTFOE.Bits.PTFOE2
#define PORT_PTFOE_PTFOE3               _PORT_PTFOE.Bits.PTFOE3
#define PORT_PTFOE_PTFOE4               _PORT_PTFOE.Bits.PTFOE4
#define PORT_PTFOE_PTFOE5               _PORT_PTFOE.Bits.PTFOE5
#define PORT_PTFOE_PTFOE6               _PORT_PTFOE.Bits.PTFOE6
#define PORT_PTFOE_PTFOE7               _PORT_PTFOE.Bits.PTFOE7

#define PORT_PTFOE_PTFOE0_MASK          1U
#define PORT_PTFOE_PTFOE1_MASK          2U
#define PORT_PTFOE_PTFOE2_MASK          4U
#define PORT_PTFOE_PTFOE3_MASK          8U
#define PORT_PTFOE_PTFOE4_MASK          16U
#define PORT_PTFOE_PTFOE5_MASK          32U
#define PORT_PTFOE_PTFOE6_MASK          64U
#define PORT_PTFOE_PTFOE7_MASK          128U


/*** PORT_PTGOE - Port G Output Enable Register; 0x000030B6 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGOE0      :1;                                       /* Output Enable for Port G Bit 0 */
    byte PTGOE1      :1;                                       /* Output Enable for Port G Bit 1 */
    byte PTGOE2      :1;                                       /* Output Enable for Port G Bit 2 */
    byte PTGOE3      :1;                                       /* Output Enable for Port G Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGOE :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PORT_PTGOESTR;
extern volatile PORT_PTGOESTR _PORT_PTGOE @0x000030B6;
#define PORT_PTGOE                      _PORT_PTGOE.Byte
#define PORT_PTGOE_PTGOE0               _PORT_PTGOE.Bits.PTGOE0
#define PORT_PTGOE_PTGOE1               _PORT_PTGOE.Bits.PTGOE1
#define PORT_PTGOE_PTGOE2               _PORT_PTGOE.Bits.PTGOE2
#define PORT_PTGOE_PTGOE3               _PORT_PTGOE.Bits.PTGOE3
#define PORT_PTGOE_PTGOE                _PORT_PTGOE.MergedBits.grpPTGOE

#define PORT_PTGOE_PTGOE0_MASK          1U
#define PORT_PTGOE_PTGOE1_MASK          2U
#define PORT_PTGOE_PTGOE2_MASK          4U
#define PORT_PTGOE_PTGOE3_MASK          8U
#define PORT_PTGOE_PTGOE_MASK           15U
#define PORT_PTGOE_PTGOE_BITNUM         0U


/*** PORT_PTHOE - Port H Output Enable Register; 0x000030B7 ***/
typedef union {
  byte Byte;
  struct {
    byte PTHOE0      :1;                                       /* Output Enable for Port H Bit 0 */
    byte PTHOE1      :1;                                       /* Output Enable for Port H Bit 1 */
    byte PTHOE2      :1;                                       /* Output Enable for Port H Bit 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTHOE6      :1;                                       /* Output Enable for Port H Bit 6 */
    byte PTHOE7      :1;                                       /* Output Enable for Port H Bit 7 */
  } Bits;
  struct {
    byte grpPTHOE :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpPTHOE_6 :2;
  } MergedBits;
} PORT_PTHOESTR;
extern volatile PORT_PTHOESTR _PORT_PTHOE @0x000030B7;
#define PORT_PTHOE                      _PORT_PTHOE.Byte
#define PORT_PTHOE_PTHOE0               _PORT_PTHOE.Bits.PTHOE0
#define PORT_PTHOE_PTHOE1               _PORT_PTHOE.Bits.PTHOE1
#define PORT_PTHOE_PTHOE2               _PORT_PTHOE.Bits.PTHOE2
#define PORT_PTHOE_PTHOE6               _PORT_PTHOE.Bits.PTHOE6
#define PORT_PTHOE_PTHOE7               _PORT_PTHOE.Bits.PTHOE7
#define PORT_PTHOE_PTHOE                _PORT_PTHOE.MergedBits.grpPTHOE
#define PORT_PTHOE_PTHOE_6              _PORT_PTHOE.MergedBits.grpPTHOE_6

#define PORT_PTHOE_PTHOE0_MASK          1U
#define PORT_PTHOE_PTHOE1_MASK          2U
#define PORT_PTHOE_PTHOE2_MASK          4U
#define PORT_PTHOE_PTHOE6_MASK          64U
#define PORT_PTHOE_PTHOE7_MASK          128U
#define PORT_PTHOE_PTHOE_MASK           7U
#define PORT_PTHOE_PTHOE_BITNUM         0U
#define PORT_PTHOE_PTHOE_6_MASK         192U
#define PORT_PTHOE_PTHOE_6_BITNUM       6U


/*** PORT_PTAIE - Port A Input Enable Register; 0x000030B8 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAIE0      :1;                                       /* Input Enable for Port A Bit 0 */
    byte PTAIE1      :1;                                       /* Input Enable for Port A Bit 1 */
    byte PTAIE2      :1;                                       /* Input Enable for Port A Bit 2 */
    byte PTAIE3      :1;                                       /* Input Enable for Port A Bit 3 */
    byte             :1; 
    byte PTAIE5      :1;                                       /* Input Enable for Port A Bit 5 */
    byte PTAIE6      :1;                                       /* Input Enable for Port A Bit 6 */
    byte PTAIE7      :1;                                       /* Input Enable for Port A Bit 7 */
  } Bits;
  struct {
    byte grpPTAIE :4;
    byte         :1;
    byte grpPTAIE_5 :3;
  } MergedBits;
} PORT_PTAIESTR;
