podonoghue/usbdm-flash-routines/HCS08-PTxx-flash-program/Project_Headers/mc9s08pt60.h
#define PORT_PTDIE_PTDIE0_MASK          1U
#define PORT_PTDIE_PTDIE1_MASK          2U
#define PORT_PTDIE_PTDIE2_MASK          4U
#define PORT_PTDIE_PTDIE3_MASK          8U
#define PORT_PTDIE_PTDIE4_MASK          16U
#define PORT_PTDIE_PTDIE5_MASK          32U
#define PORT_PTDIE_PTDIE6_MASK          64U
#define PORT_PTDIE_PTDIE7_MASK          128U


/*** PORT_PTEIE - Port E Input Enable Register; 0x000030BC ***/
typedef union {
  byte Byte;
  struct {
    byte PTEIE0      :1;                                       /* Input Enable for Port E Bit 0 */
    byte PTEIE1      :1;                                       /* Input Enable for Port E Bit 1 */
    byte PTEIE2      :1;                                       /* Input Enable for Port E Bit 2 */
    byte PTEIE3      :1;                                       /* Input Enable for Port E Bit 3 */
    byte PTEIE4      :1;                                       /* Input Enable for Port E Bit 4 */
    byte PTEIE5      :1;                                       /* Input Enable for Port E Bit 5 */
    byte PTEIE6      :1;                                       /* Input Enable for Port E Bit 6 */
    byte PTEIE7      :1;                                       /* Input Enable for Port E Bit 7 */
  } Bits;
} PORT_PTEIESTR;
extern volatile PORT_PTEIESTR _PORT_PTEIE @0x000030BC;
#define PORT_PTEIE                      _PORT_PTEIE.Byte
#define PORT_PTEIE_PTEIE0               _PORT_PTEIE.Bits.PTEIE0
#define PORT_PTEIE_PTEIE1               _PORT_PTEIE.Bits.PTEIE1
#define PORT_PTEIE_PTEIE2               _PORT_PTEIE.Bits.PTEIE2
#define PORT_PTEIE_PTEIE3               _PORT_PTEIE.Bits.PTEIE3
#define PORT_PTEIE_PTEIE4               _PORT_PTEIE.Bits.PTEIE4
#define PORT_PTEIE_PTEIE5               _PORT_PTEIE.Bits.PTEIE5
#define PORT_PTEIE_PTEIE6               _PORT_PTEIE.Bits.PTEIE6
#define PORT_PTEIE_PTEIE7               _PORT_PTEIE.Bits.PTEIE7

#define PORT_PTEIE_PTEIE0_MASK          1U
#define PORT_PTEIE_PTEIE1_MASK          2U
#define PORT_PTEIE_PTEIE2_MASK          4U
#define PORT_PTEIE_PTEIE3_MASK          8U
#define PORT_PTEIE_PTEIE4_MASK          16U
#define PORT_PTEIE_PTEIE5_MASK          32U
#define PORT_PTEIE_PTEIE6_MASK          64U
#define PORT_PTEIE_PTEIE7_MASK          128U


/*** PORT_PTFIE - Port F Input Enable Register; 0x000030BD ***/
typedef union {
  byte Byte;
  struct {
    byte PTFIE0      :1;                                       /* Input Enable for Port F Bit 0 */
    byte PTFIE1      :1;                                       /* Input Enable for Port F Bit 1 */
    byte PTFIE2      :1;                                       /* Input Enable for Port F Bit 2 */
    byte PTFIE3      :1;                                       /* Input Enable for Port F Bit 3 */
    byte PTFIE4      :1;                                       /* Input Enable for Port F Bit 4 */
    byte PTFIE5      :1;                                       /* Input Enable for Port F Bit 5 */
    byte PTFIE6      :1;                                       /* Input Enable for Port F Bit 6 */
    byte PTFIE7      :1;                                       /* Input Enable for Port F Bit 7 */
  } Bits;
} PORT_PTFIESTR;
extern volatile PORT_PTFIESTR _PORT_PTFIE @0x000030BD;
#define PORT_PTFIE                      _PORT_PTFIE.Byte
#define PORT_PTFIE_PTFIE0               _PORT_PTFIE.Bits.PTFIE0
#define PORT_PTFIE_PTFIE1               _PORT_PTFIE.Bits.PTFIE1
#define PORT_PTFIE_PTFIE2               _PORT_PTFIE.Bits.PTFIE2
#define PORT_PTFIE_PTFIE3               _PORT_PTFIE.Bits.PTFIE3
#define PORT_PTFIE_PTFIE4               _PORT_PTFIE.Bits.PTFIE4
#define PORT_PTFIE_PTFIE5               _PORT_PTFIE.Bits.PTFIE5
#define PORT_PTFIE_PTFIE6               _PORT_PTFIE.Bits.PTFIE6
#define PORT_PTFIE_PTFIE7               _PORT_PTFIE.Bits.PTFIE7

#define PORT_PTFIE_PTFIE0_MASK          1U
#define PORT_PTFIE_PTFIE1_MASK          2U
#define PORT_PTFIE_PTFIE2_MASK          4U
#define PORT_PTFIE_PTFIE3_MASK          8U
#define PORT_PTFIE_PTFIE4_MASK          16U
#define PORT_PTFIE_PTFIE5_MASK          32U
#define PORT_PTFIE_PTFIE6_MASK          64U
#define PORT_PTFIE_PTFIE7_MASK          128U


/*** PORT_PTGIE - Port G Input Enable Register; 0x000030BE ***/
typedef union {
  byte Byte;
  struct {
    byte PTGIE0      :1;                                       /* Input Enable for Port G Bit 0 */
    byte PTGIE1      :1;                                       /* Input Enable for Port G Bit 1 */
    byte PTGIE2      :1;                                       /* Input Enable for Port G Bit 2 */
    byte PTGIE3      :1;                                       /* Input Enable for Port G Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGIE :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PORT_PTGIESTR;
extern volatile PORT_PTGIESTR _PORT_PTGIE @0x000030BE;
#define PORT_PTGIE                      _PORT_PTGIE.Byte
#define PORT_PTGIE_PTGIE0               _PORT_PTGIE.Bits.PTGIE0
#define PORT_PTGIE_PTGIE1               _PORT_PTGIE.Bits.PTGIE1
#define PORT_PTGIE_PTGIE2               _PORT_PTGIE.Bits.PTGIE2
#define PORT_PTGIE_PTGIE3               _PORT_PTGIE.Bits.PTGIE3
#define PORT_PTGIE_PTGIE                _PORT_PTGIE.MergedBits.grpPTGIE

#define PORT_PTGIE_PTGIE0_MASK          1U
#define PORT_PTGIE_PTGIE1_MASK          2U
#define PORT_PTGIE_PTGIE2_MASK          4U
#define PORT_PTGIE_PTGIE3_MASK          8U
#define PORT_PTGIE_PTGIE_MASK           15U
#define PORT_PTGIE_PTGIE_BITNUM         0U


/*** PORT_PTHIE - Port H Input Enable Register; 0x000030BF ***/
typedef union {
  byte Byte;
  struct {
    byte PTHIE0      :1;                                       /* Input Enable for Port H Bit 0 */
    byte PTHIE1      :1;                                       /* Input Enable for Port H Bit 1 */
    byte PTHIE2      :1;                                       /* Input Enable for Port H Bit 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTHIE6      :1;                                       /* Input Enable for Port H Bit 6 */
    byte PTHIE7      :1;                                       /* Input Enable for Port H Bit 7 */
  } Bits;
  struct {
    byte grpPTHIE :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpPTHIE_6 :2;
  } MergedBits;
} PORT_PTHIESTR;
extern volatile PORT_PTHIESTR _PORT_PTHIE @0x000030BF;
#define PORT_PTHIE                      _PORT_PTHIE.Byte
#define PORT_PTHIE_PTHIE0               _PORT_PTHIE.Bits.PTHIE0
#define PORT_PTHIE_PTHIE1               _PORT_PTHIE.Bits.PTHIE1
#define PORT_PTHIE_PTHIE2               _PORT_PTHIE.Bits.PTHIE2
#define PORT_PTHIE_PTHIE6               _PORT_PTHIE.Bits.PTHIE6
#define PORT_PTHIE_PTHIE7               _PORT_PTHIE.Bits.PTHIE7
#define PORT_PTHIE_PTHIE                _PORT_PTHIE.MergedBits.grpPTHIE
#define PORT_PTHIE_PTHIE_6              _PORT_PTHIE.MergedBits.grpPTHIE_6

#define PORT_PTHIE_PTHIE0_MASK          1U
#define PORT_PTHIE_PTHIE1_MASK          2U
#define PORT_PTHIE_PTHIE2_MASK          4U
#define PORT_PTHIE_PTHIE6_MASK          64U
#define PORT_PTHIE_PTHIE7_MASK          128U
#define PORT_PTHIE_PTHIE_MASK           7U
#define PORT_PTHIE_PTHIE_BITNUM         0U
#define PORT_PTHIE_PTHIE_6_MASK         192U
#define PORT_PTHIE_PTHIE_6_BITNUM       6U


/*** FTM2_SC - Status and Control; 0x000030C0 ***/
typedef union {
  byte Byte;
  struct {
    byte PS0         :1;                                       /* Prescale Factor Selection, bit 0 */
    byte PS1         :1;                                       /* Prescale Factor Selection, bit 1 */
    byte PS2         :1;                                       /* Prescale Factor Selection, bit 2 */
    byte CLKS0       :1;                                       /* Clock Source Selection, bit 0 */
    byte CLKS1       :1;                                       /* Clock Source Selection, bit 1 */
    byte CPWMS       :1;                                       /* Center-aligned PWM Select */
    byte TOIE        :1;                                       /* Timer Overflow Interrupt Enable */
    byte TOF         :1;                                       /* Timer Overflow Flag */
  } Bits;
  struct {
    byte grpPS   :3;
    byte grpCLKS :2;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} FTM2_SCSTR;
extern volatile FTM2_SCSTR _FTM2_SC @0x000030C0;
#define FTM2_SC                         _FTM2_SC.Byte
#define FTM2_SC_PS0                     _FTM2_SC.Bits.PS0
#define FTM2_SC_PS1                     _FTM2_SC.Bits.PS1
#define FTM2_SC_PS2                     _FTM2_SC.Bits.PS2
#define FTM2_SC_CLKS0                   _FTM2_SC.Bits.CLKS0
#define FTM2_SC_CLKS1                   _FTM2_SC.Bits.CLKS1
#define FTM2_SC_CPWMS                   _FTM2_SC.Bits.CPWMS
#define FTM2_SC_TOIE                    _FTM2_SC.Bits.TOIE
#define FTM2_SC_TOF                     _FTM2_SC.Bits.TOF
#define FTM2_SC_PS                      _FTM2_SC.MergedBits.grpPS
#define FTM2_SC_CLKS                    _FTM2_SC.MergedBits.grpCLKS

#define FTM2_SC_PS0_MASK                1U
#define FTM2_SC_PS1_MASK                2U
#define FTM2_SC_PS2_MASK                4U
#define FTM2_SC_CLKS0_MASK              8U
#define FTM2_SC_CLKS1_MASK              16U
#define FTM2_SC_CPWMS_MASK              32U
#define FTM2_SC_TOIE_MASK               64U
#define FTM2_SC_TOF_MASK                128U
#define FTM2_SC_PS_MASK                 7U
#define FTM2_SC_PS_BITNUM               0U
#define FTM2_SC_CLKS_MASK               24U
#define FTM2_SC_CLKS_BITNUM             3U


/*** FTM2_CNT - FTM2 Timer Counter Register; 0x000030C1 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FTM2_CNTH - Counter High; 0x000030C1 ***/
    union {
      byte Byte;
    } FTM2_CNTHSTR;
    #define FTM2_CNTH                   _FTM2_CNT.Overlap_STR.FTM2_CNTHSTR.Byte
    

    /*** FTM2_CNTL - Counter Low; 0x000030C2 ***/
    union {
      byte Byte;
    } FTM2_CNTLSTR;
    #define FTM2_CNTL                   _FTM2_CNT.Overlap_STR.FTM2_CNTLSTR.Byte
    
  } Overlap_STR;

} FTM2_CNTSTR;
extern volatile FTM2_CNTSTR _FTM2_CNT @0x000030C1;
#define FTM2_CNT                        _FTM2_CNT.Word


/*** FTM2_MOD - FTM2 Timer Counter Modulo Register; 0x000030C3 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FTM2_MODH - Modulo High; 0x000030C3 ***/
    union {
      byte Byte;
    } FTM2_MODHSTR;
    #define FTM2_MODH                   _FTM2_MOD.Overlap_STR.FTM2_MODHSTR.Byte
    

    /*** FTM2_MODL - Modulo Low; 0x000030C4 ***/
    union {
      byte Byte;
    } FTM2_MODLSTR;
    #define FTM2_MODL                   _FTM2_MOD.Overlap_STR.FTM2_MODLSTR.Byte
    
  } Overlap_STR;

} FTM2_MODSTR;
