podonoghue/usbdm-flash-routines/HCS08-PTxx-flash-program/Project_Headers/mc9s08pt60.h
extern volatile PORT_PTCPESTR _PORT_PTCPE @0x000030F2;
#define PORT_PTCPE                      _PORT_PTCPE.Byte
#define PORT_PTCPE_PTCPE0               _PORT_PTCPE.Bits.PTCPE0
#define PORT_PTCPE_PTCPE1               _PORT_PTCPE.Bits.PTCPE1
#define PORT_PTCPE_PTCPE2               _PORT_PTCPE.Bits.PTCPE2
#define PORT_PTCPE_PTCPE3               _PORT_PTCPE.Bits.PTCPE3
#define PORT_PTCPE_PTCPE4               _PORT_PTCPE.Bits.PTCPE4
#define PORT_PTCPE_PTCPE5               _PORT_PTCPE.Bits.PTCPE5
#define PORT_PTCPE_PTCPE6               _PORT_PTCPE.Bits.PTCPE6
#define PORT_PTCPE_PTCPE7               _PORT_PTCPE.Bits.PTCPE7

#define PORT_PTCPE_PTCPE0_MASK          1U
#define PORT_PTCPE_PTCPE1_MASK          2U
#define PORT_PTCPE_PTCPE2_MASK          4U
#define PORT_PTCPE_PTCPE3_MASK          8U
#define PORT_PTCPE_PTCPE4_MASK          16U
#define PORT_PTCPE_PTCPE5_MASK          32U
#define PORT_PTCPE_PTCPE6_MASK          64U
#define PORT_PTCPE_PTCPE7_MASK          128U


/*** PORT_PTDPE - Port D Pullup Enable Register; 0x000030F3 ***/
typedef union {
  byte Byte;
  struct {
    byte PTDPE0      :1;                                       /* Pull Enable for Port D Bit 0 */
    byte PTDPE1      :1;                                       /* Pull Enable for Port D Bit 1 */
    byte PTDPE2      :1;                                       /* Pull Enable for Port D Bit 2 */
    byte PTDPE3      :1;                                       /* Pull Enable for Port D Bit 3 */
    byte PTDPE4      :1;                                       /* Pull Enable for Port D Bit 4 */
    byte PTDPE5      :1;                                       /* Pull Enable for Port D Bit 5 */
    byte PTDPE6      :1;                                       /* Pull Enable for Port D Bit 6 */
    byte PTDPE7      :1;                                       /* Pull Enable for Port D Bit 7 */
  } Bits;
} PORT_PTDPESTR;
extern volatile PORT_PTDPESTR _PORT_PTDPE @0x000030F3;
#define PORT_PTDPE                      _PORT_PTDPE.Byte
#define PORT_PTDPE_PTDPE0               _PORT_PTDPE.Bits.PTDPE0
#define PORT_PTDPE_PTDPE1               _PORT_PTDPE.Bits.PTDPE1
#define PORT_PTDPE_PTDPE2               _PORT_PTDPE.Bits.PTDPE2
#define PORT_PTDPE_PTDPE3               _PORT_PTDPE.Bits.PTDPE3
#define PORT_PTDPE_PTDPE4               _PORT_PTDPE.Bits.PTDPE4
#define PORT_PTDPE_PTDPE5               _PORT_PTDPE.Bits.PTDPE5
#define PORT_PTDPE_PTDPE6               _PORT_PTDPE.Bits.PTDPE6
#define PORT_PTDPE_PTDPE7               _PORT_PTDPE.Bits.PTDPE7

#define PORT_PTDPE_PTDPE0_MASK          1U
#define PORT_PTDPE_PTDPE1_MASK          2U
#define PORT_PTDPE_PTDPE2_MASK          4U
#define PORT_PTDPE_PTDPE3_MASK          8U
#define PORT_PTDPE_PTDPE4_MASK          16U
#define PORT_PTDPE_PTDPE5_MASK          32U
#define PORT_PTDPE_PTDPE6_MASK          64U
#define PORT_PTDPE_PTDPE7_MASK          128U


/*** PORT_PTEPE - Port E Pullup Enable Register; 0x000030F4 ***/
typedef union {
  byte Byte;
  struct {
    byte PTEPE0      :1;                                       /* Pull Enable for Port E Bit 0 */
    byte PTEPE1      :1;                                       /* Pull Enable for Port E Bit 1 */
    byte PTEPE2      :1;                                       /* Pull Enable for Port E Bit 2 */
    byte PTEPE3      :1;                                       /* Pull Enable for Port E Bit 3 */
    byte PTEPE4      :1;                                       /* Pull Enable for Port E Bit 4 */
    byte PTEPE5      :1;                                       /* Pull Enable for Port E Bit 5 */
    byte PTEPE6      :1;                                       /* Pull Enable for Port E Bit 6 */
    byte PTEPE7      :1;                                       /* Pull Enable for Port E Bit 7 */
  } Bits;
} PORT_PTEPESTR;
extern volatile PORT_PTEPESTR _PORT_PTEPE @0x000030F4;
#define PORT_PTEPE                      _PORT_PTEPE.Byte
#define PORT_PTEPE_PTEPE0               _PORT_PTEPE.Bits.PTEPE0
#define PORT_PTEPE_PTEPE1               _PORT_PTEPE.Bits.PTEPE1
#define PORT_PTEPE_PTEPE2               _PORT_PTEPE.Bits.PTEPE2
#define PORT_PTEPE_PTEPE3               _PORT_PTEPE.Bits.PTEPE3
#define PORT_PTEPE_PTEPE4               _PORT_PTEPE.Bits.PTEPE4
#define PORT_PTEPE_PTEPE5               _PORT_PTEPE.Bits.PTEPE5
#define PORT_PTEPE_PTEPE6               _PORT_PTEPE.Bits.PTEPE6
#define PORT_PTEPE_PTEPE7               _PORT_PTEPE.Bits.PTEPE7

#define PORT_PTEPE_PTEPE0_MASK          1U
#define PORT_PTEPE_PTEPE1_MASK          2U
#define PORT_PTEPE_PTEPE2_MASK          4U
#define PORT_PTEPE_PTEPE3_MASK          8U
#define PORT_PTEPE_PTEPE4_MASK          16U
#define PORT_PTEPE_PTEPE5_MASK          32U
#define PORT_PTEPE_PTEPE6_MASK          64U
#define PORT_PTEPE_PTEPE7_MASK          128U


/*** PORT_PTFPE - Port F Pullup Enable Register; 0x000030F5 ***/
typedef union {
  byte Byte;
  struct {
    byte PTFPE0      :1;                                       /* Pull Enable for Port F Bit 0 */
    byte PTFPE1      :1;                                       /* Pull Enable for Port F Bit 1 */
    byte PTFPE2      :1;                                       /* Pull Enable for Port F Bit 2 */
    byte PTFPE3      :1;                                       /* Pull Enable for Port F Bit 3 */
    byte PTFPE4      :1;                                       /* Pull Enable for Port F Bit 4 */
    byte PTFPE5      :1;                                       /* Pull Enable for Port F Bit 5 */
    byte PTFPE6      :1;                                       /* Pull Enable for Port F Bit 6 */
    byte PTFPE7      :1;                                       /* Pull Enable for Port F Bit 7 */
  } Bits;
} PORT_PTFPESTR;
extern volatile PORT_PTFPESTR _PORT_PTFPE @0x000030F5;
#define PORT_PTFPE                      _PORT_PTFPE.Byte
#define PORT_PTFPE_PTFPE0               _PORT_PTFPE.Bits.PTFPE0
#define PORT_PTFPE_PTFPE1               _PORT_PTFPE.Bits.PTFPE1
#define PORT_PTFPE_PTFPE2               _PORT_PTFPE.Bits.PTFPE2
#define PORT_PTFPE_PTFPE3               _PORT_PTFPE.Bits.PTFPE3
#define PORT_PTFPE_PTFPE4               _PORT_PTFPE.Bits.PTFPE4
#define PORT_PTFPE_PTFPE5               _PORT_PTFPE.Bits.PTFPE5
#define PORT_PTFPE_PTFPE6               _PORT_PTFPE.Bits.PTFPE6
#define PORT_PTFPE_PTFPE7               _PORT_PTFPE.Bits.PTFPE7

#define PORT_PTFPE_PTFPE0_MASK          1U
#define PORT_PTFPE_PTFPE1_MASK          2U
#define PORT_PTFPE_PTFPE2_MASK          4U
#define PORT_PTFPE_PTFPE3_MASK          8U
#define PORT_PTFPE_PTFPE4_MASK          16U
#define PORT_PTFPE_PTFPE5_MASK          32U
#define PORT_PTFPE_PTFPE6_MASK          64U
#define PORT_PTFPE_PTFPE7_MASK          128U


/*** PORT_PTGPE - Port G Pullup Enable Register; 0x000030F6 ***/
typedef union {
  byte Byte;
  struct {
    byte PTGPE0      :1;                                       /* Pull Enable for Port G Bit 0 */
    byte PTGPE1      :1;                                       /* Pull Enable for Port G Bit 1 */
    byte PTGPE2      :1;                                       /* Pull Enable for Port G Bit 2 */
    byte PTGPE3      :1;                                       /* Pull Enable for Port G Bit 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTGPE :4;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} PORT_PTGPESTR;
extern volatile PORT_PTGPESTR _PORT_PTGPE @0x000030F6;
#define PORT_PTGPE                      _PORT_PTGPE.Byte
#define PORT_PTGPE_PTGPE0               _PORT_PTGPE.Bits.PTGPE0
#define PORT_PTGPE_PTGPE1               _PORT_PTGPE.Bits.PTGPE1
#define PORT_PTGPE_PTGPE2               _PORT_PTGPE.Bits.PTGPE2
#define PORT_PTGPE_PTGPE3               _PORT_PTGPE.Bits.PTGPE3
#define PORT_PTGPE_PTGPE                _PORT_PTGPE.MergedBits.grpPTGPE

#define PORT_PTGPE_PTGPE0_MASK          1U
#define PORT_PTGPE_PTGPE1_MASK          2U
#define PORT_PTGPE_PTGPE2_MASK          4U
#define PORT_PTGPE_PTGPE3_MASK          8U
#define PORT_PTGPE_PTGPE_MASK           15U
#define PORT_PTGPE_PTGPE_BITNUM         0U


/*** PORT_PTHPE - Port H Pullup Enable Register; 0x000030F7 ***/
typedef union {
  byte Byte;
  struct {
    byte PTHPE0      :1;                                       /* Pull Enable for Port H Bit 0 */
    byte PTHPE1      :1;                                       /* Pull Enable for Port H Bit 1 */
    byte PTHPE2      :1;                                       /* Pull Enable for Port H Bit 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTHPE6      :1;                                       /* Pull Enable for Port H Bit 6 */
    byte PTHPE7      :1;                                       /* Pull Enable for Port H Bit 7 */
  } Bits;
  struct {
    byte grpPTHPE :3;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpPTHPE_6 :2;
  } MergedBits;
} PORT_PTHPESTR;
extern volatile PORT_PTHPESTR _PORT_PTHPE @0x000030F7;
#define PORT_PTHPE                      _PORT_PTHPE.Byte
#define PORT_PTHPE_PTHPE0               _PORT_PTHPE.Bits.PTHPE0
#define PORT_PTHPE_PTHPE1               _PORT_PTHPE.Bits.PTHPE1
#define PORT_PTHPE_PTHPE2               _PORT_PTHPE.Bits.PTHPE2
#define PORT_PTHPE_PTHPE6               _PORT_PTHPE.Bits.PTHPE6
#define PORT_PTHPE_PTHPE7               _PORT_PTHPE.Bits.PTHPE7
#define PORT_PTHPE_PTHPE                _PORT_PTHPE.MergedBits.grpPTHPE
#define PORT_PTHPE_PTHPE_6              _PORT_PTHPE.MergedBits.grpPTHPE_6

