podonoghue/usbdm-flash-routines/HCS08-PTxx-flash-program/Project_Headers/mc9s08pt60.h
/* Tip for register initialization in the user code:  const byte NV_FSEC_INIT @0x0000FF7F = <NV_FSEC_INITVAL>; */
#define _NV_FSEC (*(const NV_FSECSTR * __far)0x0000FF7F)
#define NV_FSEC                         _NV_FSEC.Byte
#define NV_FSEC_SEC0                    _NV_FSEC.Bits.SEC0
#define NV_FSEC_SEC1                    _NV_FSEC.Bits.SEC1
#define NV_FSEC_KEYEN0                  _NV_FSEC.Bits.KEYEN0
#define NV_FSEC_KEYEN1                  _NV_FSEC.Bits.KEYEN1
#define NV_FSEC_SEC                     _NV_FSEC.MergedBits.grpSEC
#define NV_FSEC_KEYEN                   _NV_FSEC.MergedBits.grpKEYEN

#define NV_FSEC_SEC0_MASK               1U
#define NV_FSEC_SEC1_MASK               2U
#define NV_FSEC_KEYEN0_MASK             64U
#define NV_FSEC_KEYEN1_MASK             128U
#define NV_FSEC_SEC_MASK                3U
#define NV_FSEC_SEC_BITNUM              0U
#define NV_FSEC_KEYEN_MASK              192U
#define NV_FSEC_KEYEN_BITNUM            6U



/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */



/* **** 1/16/2012 5:50:57 PM */

#define SPI0_DL                          SPI0_D
#define SPI0_DL_Bits0                    This_symb_has_been_depreciated
#define SPI0_DL_Bits1                    This_symb_has_been_depreciated
#define SPI0_DL_Bits2                    This_symb_has_been_depreciated
#define SPI0_DL_Bits3                    This_symb_has_been_depreciated
#define SPI0_DL_Bits4                    This_symb_has_been_depreciated
#define SPI0_DL_Bits5                    This_symb_has_been_depreciated
#define SPI0_DL_Bits6                    This_symb_has_been_depreciated
#define SPI0_DL_Bits7                    This_symb_has_been_depreciated
#define SPI0_DL_Bits0_MASK               This_symb_has_been_depreciated
#define SPI0_DL_Bits1_MASK               This_symb_has_been_depreciated
#define SPI0_DL_Bits2_MASK               This_symb_has_been_depreciated
#define SPI0_DL_Bits3_MASK               This_symb_has_been_depreciated
#define SPI0_DL_Bits4_MASK               This_symb_has_been_depreciated
#define SPI0_DL_Bits5_MASK               This_symb_has_been_depreciated
#define SPI0_DL_Bits6_MASK               This_symb_has_been_depreciated
#define SPI0_DL_Bits7_MASK               This_symb_has_been_depreciated
#define SPI0_ML                          SPI0_M
#define SPI0_ML_Bits0                    This_symb_has_been_depreciated
#define SPI0_ML_Bits1                    This_symb_has_been_depreciated
#define SPI0_ML_Bits2                    This_symb_has_been_depreciated
#define SPI0_ML_Bits3                    This_symb_has_been_depreciated
#define SPI0_ML_Bits4                    This_symb_has_been_depreciated
#define SPI0_ML_Bits5                    This_symb_has_been_depreciated
#define SPI0_ML_Bits6                    This_symb_has_been_depreciated
#define SPI0_ML_Bits7                    This_symb_has_been_depreciated
#define SPI0_ML_Bits0_MASK               This_symb_has_been_depreciated
#define SPI0_ML_Bits1_MASK               This_symb_has_been_depreciated
#define SPI0_ML_Bits2_MASK               This_symb_has_been_depreciated
#define SPI0_ML_Bits3_MASK               This_symb_has_been_depreciated
#define SPI0_ML_Bits4_MASK               This_symb_has_been_depreciated
#define SPI0_ML_Bits5_MASK               This_symb_has_been_depreciated
#define SPI0_ML_Bits6_MASK               This_symb_has_been_depreciated
#define SPI0_ML_Bits7_MASK               This_symb_has_been_depreciated
#define SPI0_M_Bits0                     This_symb_has_been_depreciated
#define SPI0_M_Bits1                     This_symb_has_been_depreciated
#define SPI0_M_Bits2                     This_symb_has_been_depreciated
#define SPI0_M_Bits3                     This_symb_has_been_depreciated
#define SPI0_M_Bits4                     This_symb_has_been_depreciated
#define SPI0_M_Bits5                     This_symb_has_been_depreciated
#define SPI0_M_Bits6                     This_symb_has_been_depreciated
#define SPI0_M_Bits7                     This_symb_has_been_depreciated
#define SPI0_M_Bits0_MASK                This_symb_has_been_depreciated
#define SPI0_M_Bits1_MASK                This_symb_has_been_depreciated
#define SPI0_M_Bits2_MASK                This_symb_has_been_depreciated
#define SPI0_M_Bits3_MASK                This_symb_has_been_depreciated
#define SPI0_M_Bits4_MASK                This_symb_has_been_depreciated
#define SPI0_M_Bits5_MASK                This_symb_has_been_depreciated
#define SPI0_M_Bits6_MASK                This_symb_has_been_depreciated
#define SPI0_M_Bits7_MASK                This_symb_has_been_depreciated
#define SPI1_MH_Bits0                    This_symb_has_been_depreciated
#define SPI1_MH_Bits1                    This_symb_has_been_depreciated
#define SPI1_MH_Bits2                    This_symb_has_been_depreciated
#define SPI1_MH_Bits3                    This_symb_has_been_depreciated
#define SPI1_MH_Bits4                    This_symb_has_been_depreciated
#define SPI1_MH_Bits5                    This_symb_has_been_depreciated
#define SPI1_MH_Bits6                    This_symb_has_been_depreciated
#define SPI1_MH_Bits7                    This_symb_has_been_depreciated
#define SPI1_MH_Bits0_MASK               This_symb_has_been_depreciated
#define SPI1_MH_Bits1_MASK               This_symb_has_been_depreciated
#define SPI1_MH_Bits2_MASK               This_symb_has_been_depreciated
#define SPI1_MH_Bits3_MASK               This_symb_has_been_depreciated
#define SPI1_MH_Bits4_MASK               This_symb_has_been_depreciated
#define SPI1_MH_Bits5_MASK               This_symb_has_been_depreciated
#define SPI1_MH_Bits6_MASK               This_symb_has_been_depreciated
#define SPI1_MH_Bits7_MASK               This_symb_has_been_depreciated
#define SPI1_ML_Bits0                    This_symb_has_been_depreciated
#define SPI1_ML_Bits1                    This_symb_has_been_depreciated
#define SPI1_ML_Bits2                    This_symb_has_been_depreciated
#define SPI1_ML_Bits3                    This_symb_has_been_depreciated
#define SPI1_ML_Bits4                    This_symb_has_been_depreciated
#define SPI1_ML_Bits5                    This_symb_has_been_depreciated
#define SPI1_ML_Bits6                    This_symb_has_been_depreciated
#define SPI1_ML_Bits7                    This_symb_has_been_depreciated
#define SPI1_ML_Bits0_MASK               This_symb_has_been_depreciated
#define SPI1_ML_Bits1_MASK               This_symb_has_been_depreciated
#define SPI1_ML_Bits2_MASK               This_symb_has_been_depreciated
#define SPI1_ML_Bits3_MASK               This_symb_has_been_depreciated
#define SPI1_ML_Bits4_MASK               This_symb_has_been_depreciated
#define SPI1_ML_Bits5_MASK               This_symb_has_been_depreciated
#define SPI1_ML_Bits6_MASK               This_symb_has_been_depreciated
#define SPI1_ML_Bits7_MASK               This_symb_has_been_depreciated
#define PORT_IOFLT0_FILA0                PORT_IOFLT0_FLTA0
#define PORT_IOFLT0_FILA1                PORT_IOFLT0_FLTA1
#define PORT_IOFLT0_FILB0                PORT_IOFLT0_FLTB0
#define PORT_IOFLT0_FILB1                PORT_IOFLT0_FLTB1
#define PORT_IOFLT0_FILC0                PORT_IOFLT0_FLTC0
#define PORT_IOFLT0_FILC1                PORT_IOFLT0_FLTC1
#define PORT_IOFLT0_FILD0                PORT_IOFLT0_FLTD0
#define PORT_IOFLT0_FILD1                PORT_IOFLT0_FLTD1
#define PORT_IOFLT0_FILA                 PORT_IOFLT0_FLTA
#define PORT_IOFLT0_FILB                 PORT_IOFLT0_FLTB
#define PORT_IOFLT0_FILC                 PORT_IOFLT0_FLTC
#define PORT_IOFLT0_FILD                 PORT_IOFLT0_FLTD
#define PORT_IOFLT0_FILA0_MASK           PORT_IOFLT0_FLTA0_MASK
#define PORT_IOFLT0_FILA1_MASK           PORT_IOFLT0_FLTA1_MASK
#define PORT_IOFLT0_FILB0_MASK           PORT_IOFLT0_FLTB0_MASK
#define PORT_IOFLT0_FILB1_MASK           PORT_IOFLT0_FLTB1_MASK
#define PORT_IOFLT0_FILC0_MASK           PORT_IOFLT0_FLTC0_MASK
#define PORT_IOFLT0_FILC1_MASK           PORT_IOFLT0_FLTC1_MASK
#define PORT_IOFLT0_FILD0_MASK           PORT_IOFLT0_FLTD0_MASK
#define PORT_IOFLT0_FILD1_MASK           PORT_IOFLT0_FLTD1_MASK
#define PORT_IOFLT0_FILA_MASK            PORT_IOFLT0_FLTA_MASK
#define PORT_IOFLT0_FILA_BITNUM          PORT_IOFLT0_FLTA_BITNUM
#define PORT_IOFLT0_FILB_MASK            PORT_IOFLT0_FLTB_MASK
#define PORT_IOFLT0_FILB_BITNUM          PORT_IOFLT0_FLTB_BITNUM
#define PORT_IOFLT0_FILC_MASK            PORT_IOFLT0_FLTC_MASK
#define PORT_IOFLT0_FILC_BITNUM          PORT_IOFLT0_FLTC_BITNUM
#define PORT_IOFLT0_FILD_MASK            PORT_IOFLT0_FLTD_MASK
#define PORT_IOFLT0_FILD_BITNUM          PORT_IOFLT0_FLTD_BITNUM
#define PORT_IOFLT1_FILE0                PORT_IOFLT1_FLTE0
#define PORT_IOFLT1_FILE1                PORT_IOFLT1_FLTE1
#define PORT_IOFLT1_FILF0                PORT_IOFLT1_FLTF0
#define PORT_IOFLT1_FILF1                PORT_IOFLT1_FLTF1
#define PORT_IOFLT1_FILG0                PORT_IOFLT1_FLTG0
#define PORT_IOFLT1_FILG1                PORT_IOFLT1_FLTG1
#define PORT_IOFLT1_FILH0                PORT_IOFLT1_FLTH0
#define PORT_IOFLT1_FILH1                PORT_IOFLT1_FLTH1
#define PORT_IOFLT1_FILE                 PORT_IOFLT1_FLTE
#define PORT_IOFLT1_FILF                 PORT_IOFLT1_FLTF
#define PORT_IOFLT1_FILG                 PORT_IOFLT1_FLTG
#define PORT_IOFLT1_FILH                 PORT_IOFLT1_FLTH
#define PORT_IOFLT1_FILE0_MASK           PORT_IOFLT1_FLTE0_MASK
#define PORT_IOFLT1_FILE1_MASK           PORT_IOFLT1_FLTE1_MASK
#define PORT_IOFLT1_FILF0_MASK           PORT_IOFLT1_FLTF0_MASK
#define PORT_IOFLT1_FILF1_MASK           PORT_IOFLT1_FLTF1_MASK
#define PORT_IOFLT1_FILG0_MASK           PORT_IOFLT1_FLTG0_MASK
#define PORT_IOFLT1_FILG1_MASK           PORT_IOFLT1_FLTG1_MASK
#define PORT_IOFLT1_FILH0_MASK           PORT_IOFLT1_FLTH0_MASK
#define PORT_IOFLT1_FILH1_MASK           PORT_IOFLT1_FLTH1_MASK
#define PORT_IOFLT1_FILE_MASK            PORT_IOFLT1_FLTE_MASK
#define PORT_IOFLT1_FILE_BITNUM          PORT_IOFLT1_FLTE_BITNUM
#define PORT_IOFLT1_FILF_MASK            PORT_IOFLT1_FLTF_MASK
#define PORT_IOFLT1_FILF_BITNUM          PORT_IOFLT1_FLTF_BITNUM
#define PORT_IOFLT1_FILG_MASK            PORT_IOFLT1_FLTG_MASK
#define PORT_IOFLT1_FILG_BITNUM          PORT_IOFLT1_FLTG_BITNUM
#define PORT_IOFLT1_FILH_MASK            PORT_IOFLT1_FLTH_MASK
#define PORT_IOFLT1_FILH_BITNUM          PORT_IOFLT1_FLTH_BITNUM
#define PORT_IOFLT2_FILRST0              PORT_IOFLT2_FLTRST0
#define PORT_IOFLT2_FILRST1              PORT_IOFLT2_FLTRST1
#define PORT_IOFLT2_KBI00                PORT_IOFLT2_FLTKBI00
#define PORT_IOFLT2_KBI01                PORT_IOFLT2_FLTKBI01
#define PORT_IOFLT2_KBI10                PORT_IOFLT2_FLTKBI10
#define PORT_IOFLT2_KBI11                PORT_IOFLT2_FLTKBI11
#define PORT_IOFLT2_FILRST               PORT_IOFLT2_FLTRST
#define PORT_IOFLT2_KBI0                 PORT_IOFLT2_FLTKBI0
#define PORT_IOFLT2_KBI1                 PORT_IOFLT2_FLTKBI1
#define PORT_IOFLT2_FILRST0_MASK         PORT_IOFLT2_FLTRST0_MASK
#define PORT_IOFLT2_FILRST1_MASK         PORT_IOFLT2_FLTRST1_MASK
#define PORT_IOFLT2_KBI00_MASK           PORT_IOFLT2_FLTKBI00_MASK
#define PORT_IOFLT2_KBI01_MASK           PORT_IOFLT2_FLTKBI01_MASK
#define PORT_IOFLT2_KBI10_MASK           PORT_IOFLT2_FLTKBI10_MASK
#define PORT_IOFLT2_KBI11_MASK           PORT_IOFLT2_FLTKBI11_MASK
#define PORT_IOFLT2_FILRST_MASK          PORT_IOFLT2_FLTRST_MASK
#define PORT_IOFLT2_FILRST_BITNUM        PORT_IOFLT2_FLTRST_BITNUM
#define PORT_IOFLT2_KBI0_MASK            PORT_IOFLT2_FLTKBI0_MASK
#define PORT_IOFLT2_KBI0_BITNUM          PORT_IOFLT2_FLTKBI0_BITNUM
#define PORT_IOFLT2_KBI1_MASK            PORT_IOFLT2_FLTKBI1_MASK
#define PORT_IOFLT2_KBI1_BITNUM          PORT_IOFLT2_FLTKBI1_BITNUM
#define PORT_PTAPE_PTAPE4                This_symb_has_been_depreciated
#define PORT_PTAPE_PTAPE4_MASK           This_symb_has_been_depreciated
#endif
/*lint -restore  +esym(961,18.4) +esym(961,19.7) Enable MISRA rule (1.1,18.4,6.4,19.7) checking. */
